Ran Plan for project: `project1-test` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
this is for testing the multiple ID's

Initializing modules...
Downloading citizen.devops.atypon.com/proxmox/proxmox-vm/atypon 0.7.2 for vm...
- vm in .terraform/modules/vm

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/local...
- Finding e-breuninger/netbox versions matching "~> 2.0.4"...
- Finding telmate/proxmox versions matching "2.9.11"...
- Finding latest version of hashicorp/consul...
- Finding latest version of hashicorp/null...
- Installing hashicorp/consul v2.18.0...
- Installed hashicorp/consul v2.18.0 (signed by HashiCorp)
- Installing hashicorp/null v3.2.1...
- Installed hashicorp/null v3.2.1 (signed by HashiCorp)
- Installing hashicorp/local v2.4.0...
- Installed hashicorp/local v2.4.0 (signed by HashiCorp)
- Installing e-breuninger/netbox v2.0.7...
- Installed e-breuninger/netbox v2.0.7 (self-signed, key ID 3D7732A98C310FC7)
- Installing telmate/proxmox v2.9.11...
- Installed telmate/proxmox v2.9.11 (self-signed, key ID A9EBBE091B35AFCE)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Experimental feature "module_variable_optional_attrs" is active
│ 
│   on .terraform/modules/vm/main.tf line 9, in terraform:
│    9:   experiments      = [module_variable_optional_attrs]
│ 
│ Experimental features are subject to breaking changes in future minor or
│ patch releases, based on feedback.
│ 
│ If you have feedback on the design of this feature, please open a GitHub
│ issue to discuss it.
╵

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

rawe7

module.vm["ali-test"].data.consul_keys.dns_servers: Reading...
module.vm["ali-test"].data.consul_keys.dns_servers: Read complete after 2s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vm["ali-test"].local_file.cloud_init["network"] will be created
  + resource "local_file" "cloud_init" {
      + content              = <<-EOT
            version: 2
            renderer: NetworkManager
            ethernets:
              ens18:
                dhcp4: false
                dhcp6: false
                addresses:
                  - "10.5.1.22/16"
                gateway4: "10.5.5.3"
                nameservers:
                  search: [
                      int.atypon.com,
                      atypon.com,
                  ]
                  addresses: [
                      10.5.5.1,
                      10.5.5.6,
                      1.1.1.1,
                      8.8.8.8,
                  ]
            
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = ".terraform/modules/vm/templates/rendered/ali-test_cloud_init_network.yml"
      + id                   = (known after apply)
    }

  # module.vm["ali-test"].local_file.cloud_init["user"] will be created
  + resource "local_file" "cloud_init" {
      + content              = <<-EOT
            #cloud-config
            
            timezone: 'America/Los_Angeles'
            
            cloud_init_modules:
              - migrator
              - seed_random
              - write-files
              - growpart
              - resizefs
              - disk_setup
              - mounts
              - set_hostname
              - update_hostname
              - update_etc_hosts
              - ca-certs
              - rsyslog
              - users-groups
              - ssh
              - bootcmd
              
            cloud_config_modules:
            - runcmd
            
            cloud_final_modules:
            - puppet
            - scripts-user
            
            package_update: True
            package_upgrade: True
            package_reboot_if_required: True
            preserve_hostname: False
            apt_preserve_sources_list: False
            manage_etc_hosts: True
            hostname: ali-test
            fqdn: ali-test.atypon.com
            
            packages:
              - gnupg
              - gnupg1
              - gnupg2
              - wget
              - curl
              - qemu-guest-agent
              - nfs-common
              - lsb-release
              - ca-certificates
            
            users:
              - user: sysadmin
                lock_passwd: False
                groups: sudo
                shell: /bin/bash
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC85T2Qw97JxcSi1BMAZsBf3yUZMpsRE7j825P24nIjKbRttCyAH5uO90XZ2f/03RK5+/L3umnLjo0CaMZQ305BK7mO7s+0k4Z1EaVv3PqmQcnnts2ElpROQkKvWUaMj++B9+gqQz03VfKkuDK3XXgtlMxiDnSZ+PKIMa+dX+fGU8ziSoh6o+20a9GIZXUNAIdRZC94L0w5FBb3Q2H4VeuNVoy1QCi5kbSv/M1RjvfLBxQnLRLNmtYfujU6OnZ2uECUZpQV4Bqu2Z92ENXKJKG0IvliA1zjQa2JcThfyK8CsbOhiZIvI2osJ3E0BAELGowIiDogUQ5pF100ca3/F9fV root@prod102"
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDR71KZVeQTtapL1bvRuWUHaWEFKdoHDAZzalbK6XfKO3OMq+za4TjQkEyeOoJ2wmJ9zGyVrSuNuiGwFDD/WOIzpHyS7+tj/q644nq20PUQ7fUm1jcrps2+Szn4TuohU34E5lCbZcfegGuQQc7IS0g+G/XE3JCFSOvcNewMcXcxpcVtaNqo6xvlG0A25UFUT7Fk+WxeSHqTp/DR5g7SNsfA5syDQWqa3cxQtk9LfYHjcLjm8dm7t/Silk3pVJbcZVBDWV8OZLYWEpf3gjGPkL1sEKBdIBDesaifaR2VEpPTXIyonX4kQY39xh+XxoCHgvjwLST7HnIstEgE1u9Dak85 root@nfs"
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCxIdS+BiG7oRsfAC55V91v6rxjcKLZoG9U8D+grrM48oaXaY7iwLA27o3U3fy81z3cJirAH0d3CDMf6sAZmYsTZK9qYc4XcIy+iLN81XcSdUbcO0oMuiXqBHDWPZBeiyrh3+c74g0hXHIfR1HUqETv3AViN/THJ1qKByCuNt9H70CEVrMT1IvAuYDKYC4ZWeTmVqpgsHF+V3GxFMJBi5WJzeSUEMwr7w/YzyeLN9DB533s7oSycfQZawcfF2BTYzkQGpfB3rje8v4232o1ZnNbQCdQwO3TH1C4Q2jio12VizQ+/v3KiFWnCay3Cgiaj/IPc7k86FQyD9inA1lVzioR hradaideh@hradaideh"
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDGmXSXK0Ksx4EwvkZG+qIX6I6v4PQYEl35OISpdRa6MfmsT7Y3l0zs2FP/FATwXQvDLNYXxQUIYZkfrWWPbZJVaqjRNqs+97TM3zESUzJXOZV8zPZsS1Jo3Q3CN0A8EVIkWJFgzltM7HWSBzFthnv8nH5Q1aIJOzHv0oc+8Mm/BQKyl2QTpj1vB6zZwFf+JfYqw+ktcXwlaL2LEKOE2OnPZmeUV9shNsrSuSwbLzPJmZ2RNjkyX9R1JRpSU1D3XQdoMo/a5JuplUtOIdFl2HstzIddwSMfVxdExz4OhqFJRInGGPlrtHnVQamoRRzSEVQxhbdrXOVHLlBYVx6ttfnJyXrccWIMGh5r9e9axNTMJ2ej4yJzj8Hb2m7Bj8rgfMzRWd7l4nDn20FUvycymXhtC7b8ko/mGzPZkKNUWhW8Gs1fPG0mde8ykNduOOs2PrCDDJHsl0qwmoX3cbZ1/pHDrWAS+urfy3YC99i/zHoOsccIffmr6FgS4lLm0rTVBP6Xw530rB9HxwTRrogkAOIVrcrni2lm2yQzQt75wu4VtjLBnYnpPgG2Jc1k6qZH6BGu4QvrujmybEr/neHYaPFsk65zb5C8Iji7PsOYXekQ3rptQKC10sg3LvALaM+zbXcBP3jDIyQs6wnjyFyq94k1FbrqhKWo9nDhn8a4Du5mCQ== devops-services@atypon.com"
                  - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2sQQ9zHX4tL7OyyZoJ17ASJ8JUjMLnW1Ts+8Mxqd+tanw1GdnqaBiqsyMcu7QFDuCJsglIZ6VAQ7XtPt4hRKmzZJderA97OqKvg0Ss+RvuscTBfB5XlTpofu5G7lHTCj//dzt1pD04oLjLo5DsLaWOTc2evTnrcoQ6HTm/x/dvWuWpbhE8hH6tMYynJelxJ2SKGATR+PPrpIyAGi/W0N3HAeQHirKGo4+WhZVnCXTLgBV/9+L6T9vLRfgu4okYNSObaIDVMQOZDf354V5EZ1Y/n25hUyewMTOQIusE4dwMBBjUrgBcaUIj04xlh2T/95h37cDTgidw0bTVw6CGzy9 mokhatib@mokhatib-laptop
                  - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDX/HrxZHySKhVUPJTtdMxMGsefZljYH6enWSkMi0rq1zyiR2LU3EkbAADevRE8iR8NHPZggiWXhrPBq5ofZZ2Agi/bnGNvs44euLGHs2vapXJWQZy/fj+QExFxMPyfI0u/ljrFrnHe+2PXjyWKENiyViYwOFa75DJmhth/r6PVAW0lw47q+hxjpEwqHrdiGffdNzsR6tNc3vGs1WxoHEfYd1Et02Api/FPLy6XuovkNAioEpiDNNC+qjkgcTUKQyHeKYkKrmfcAijLd7w85AqgKhWwj1TOFm0+A40N5m0wdQL8ivQMQBexw+AkhCzEB7gOmmqN55bi/vP+kWuXvBAX adbabi@adbabi-laptop
            
            user: sysadmin
            chpasswd:
              expire: False
            disable_root: False
            
            swap:
              filename: /swap.img
              size: 8589934592
              maxsize: 8589934592
            
            disk_setup:
              /dev/vdb:
                table_type: gpt
                overwrite: True
                layout:
                  - 100
            
            fs_setup:
            
            # todo : note that empty "mounts:" causes error in cloud init service status
            # add the default value for mounts https://cloudinit.readthedocs.io/en/latest/topics/modules.html#mounts
            
            
            mounts:
              - [ None, None, "auto", "defaults,nofail", "0", "2" ]
            
            
            growpart:
              mode: auto
              devices:
              - "/"
              - "/dev/vdb1"
              ignore_growroot_disabled: false
            
            # Resize non-root filesystems after the partitions being resized by growpart
            runcmd:
              - [ resize2fs , /dev/vdb1 ]
            
            write_files:
              # this script will run a command once and then delete it
              - content: |
                  #!/bin/sh
                  
                  # redirect everything to a log file
                  exec >> /tmp/runonce_logs
                  exec 2>&1
                  
                  mkdir -p /etc/local/runonce.d/ran/
                  for file in /etc/local/runonce.d/*
                  do
                    if [ ! -f "/tmp/$file.lock" ]
                    then
                      echo "lock not found!"
                      mkdir -p /tmp/$(dirname $file)
                      touch "/tmp/$file.lock"
                      echo "Executing ! $file"
                      "$file"
                      mv "$file" "/etc/local/runonce.d/ran/$(basename $file).$(date +%Y%m%dT%H%M%S)"
                      logger -t runonce -p local3.info "$file"
                    fi
                  done
                path: /usr/local/bin/runonce
                owner: root:root
                permissions: '0777'
            
              # this script fix puppet issue, and will be run once after reboot
              - content: |
                  #!/bin/bash
                  # redirect everything to a log file
                  exec >> /tmp/puppet_logs
                  exec 2>&1
                  
                  sed -i  's?sysadmin:.*?sysadmin:$6$jlA/YPTwISYdxLng$i.X1d4kXk9z5ylaty49Bd9GGICQPXldH9Lk.bdsjtVF8QepsUAC0MlZjP8Xt.Kekltz34zqf91irOfuJZsp6I1:19040:0:99999:7:::?g' /etc/shadow
                  
                  sudo pkill -9 puppet || echo "may throw an error"
                  curl -fsSL http://puppet:8088/puppet-agent/Linux/debian/install.sh | sudo bash -s || echo "may throw an error"
                  echo -e "\n\nDone !"
                path: /etc/local/runonce.d/fix.sh
                owner: root:root
                permissions: '0777'
            
              - owner: root:root
                path: /var/spool/cron/crontabs/root
                content: |
                  */1 * * * * /usr/local/bin/runonce
                permissions: '0600'
            
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = ".terraform/modules/vm/templates/rendered/ali-test_cloud_init_user.yml"
      + id                   = (known after apply)
    }

  # module.vm["ali-test"].null_resource.cloud_init_config_files["network"] will be created
  + resource "null_resource" "cloud_init_config_files" {
      + id       = (known after apply)
      + triggers = {
          + "reupload" = "fdb8752a6992c36d46d5d4d3464e8ed2"
        }
    }

  # module.vm["ali-test"].null_resource.cloud_init_config_files["user"] will be created
  + resource "null_resource" "cloud_init_config_files" {
      + id       = (known after apply)
      + triggers = {
          + "reupload" = "c70f57acf7619e3e5b023c272a81f2c6"
        }
    }

  # module.vm["ali-test"].null_resource.exec_scripts will be created
  + resource "null_resource" "exec_scripts" {
      + id       = (known after apply)
      + triggers = {
          + "s" = jsonencode(
                {
                  + apt_proxy_enabled = false
                  + apt_proxy_url     = null
                  + clone             = {
                      + full_clone = true
                      + source     = "debian-11.5.0-amd64-1.0"
                    }
                  + desc              = null
                  + disk              = [
                      + {
                          + boot_disk_pool = "zfs"
                          + boot_disk_size = "75G"
                          + format         = null
                          + fs             = "ext4"
                          + layout         = [
                              + "100",
                            ]
                          + mbps_rd        = null
                          + mbps_rd_max    = null
                          + mbps_wr        = null
                          + mbps_wr_max    = null
                          + mount          = "/"
                          + mounted        = true
                          + partition_name = "vda"
                          + slot           = null
                          + type           = "virtio"
                        },
                      + {
                          + boot_disk_pool = "zfs"
                          + boot_disk_size = "40G"
                          + format         = null
                          + fs             = "ext4"
                          + layout         = [
                              + "100",
                            ]
                          + mbps_rd        = null
                          + mbps_rd_max    = null
                          + mbps_wr        = null
                          + mbps_wr_max    = null
                          + mount          = null
                          + mounted        = false
                          + partition_name = "vdb"
                          + slot           = null
                          + type           = "virtio"
                        },
                    ]
                  + fqdn              = "ali-test.atypon.com"
                  + hostname          = "ali-test"
                  + kind              = null
                  + last_modification = null
                  + modules           = null
                  + name              = "ali-test"
                  + network           = [
                      + {
                          + bridge = "vmbr0"
                          + gw     = "10.5.5.3"
                          + ip     = "10.5.1.22"
                          + model  = "virtio"
                          + nm     = 16
                          + tag    = null
                        },
                    ]
                  + packages          = null
                  + pool              = "Infrastructure"
                  + specs             = {
                      + balloon       = null
                      + boot_order    = "order=virtio0"
                      + config_source = "local"
                      + cores         = 32
                      + hotplug       = "network,disk,usb"
                      + memory        = 131072
                      + sockets       = 2
                      + vcpus         = 48
                    }
                  + swap_maxsize      = 8589934592
                  + swap_size         = null
                  + sysadmin_ssh_keys = [
                      + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2sQQ9zHX4tL7OyyZoJ17ASJ8JUjMLnW1Ts+8Mxqd+tanw1GdnqaBiqsyMcu7QFDuCJsglIZ6VAQ7XtPt4hRKmzZJderA97OqKvg0Ss+RvuscTBfB5XlTpofu5G7lHTCj//dzt1pD04oLjLo5DsLaWOTc2evTnrcoQ6HTm/x/dvWuWpbhE8hH6tMYynJelxJ2SKGATR+PPrpIyAGi/W0N3HAeQHirKGo4+WhZVnCXTLgBV/9+L6T9vLRfgu4okYNSObaIDVMQOZDf354V5EZ1Y/n25hUyewMTOQIusE4dwMBBjUrgBcaUIj04xlh2T/95h37cDTgidw0bTVw6CGzy9 mokhatib@mokhatib-laptop",
                      + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDX/HrxZHySKhVUPJTtdMxMGsefZljYH6enWSkMi0rq1zyiR2LU3EkbAADevRE8iR8NHPZggiWXhrPBq5ofZZ2Agi/bnGNvs44euLGHs2vapXJWQZy/fj+QExFxMPyfI0u/ljrFrnHe+2PXjyWKENiyViYwOFa75DJmhth/r6PVAW0lw47q+hxjpEwqHrdiGffdNzsR6tNc3vGs1WxoHEfYd1Et02Api/FPLy6XuovkNAioEpiDNNC+qjkgcTUKQyHeKYkKrmfcAijLd7w85AqgKhWwj1TOFm0+A40N5m0wdQL8ivQMQBexw+AkhCzEB7gOmmqN55bi/vP+kWuXvBAX adbabi@adbabi-laptop",
                    ]
                  + target_node       = "pveamman1"
                }
            )
        }
    }

  # module.vm["ali-test"].null_resource.regenerate_cloudinit will be created
  + resource "null_resource" "regenerate_cloudinit" {
      + id       = (known after apply)
      + triggers = {
          + "s" = jsonencode(
                {
                  + apt_proxy_enabled = false
                  + apt_proxy_url     = null
                  + clone             = {
                      + full_clone = true
                      + source     = "debian-11.5.0-amd64-1.0"
                    }
                  + desc              = null
                  + disk              = [
                      + {
                          + boot_disk_pool = "zfs"
                          + boot_disk_size = "75G"
                          + format         = null
                          + fs             = "ext4"
                          + layout         = [
                              + "100",
                            ]
                          + mbps_rd        = null
                          + mbps_rd_max    = null
                          + mbps_wr        = null
                          + mbps_wr_max    = null
                          + mount          = "/"
                          + mounted        = true
                          + partition_name = "vda"
                          + slot           = null
                          + type           = "virtio"
                        },
                      + {
                          + boot_disk_pool = "zfs"
                          + boot_disk_size = "40G"
                          + format         = null
                          + fs             = "ext4"
                          + layout         = [
                              + "100",
                            ]
                          + mbps_rd        = null
                          + mbps_rd_max    = null
                          + mbps_wr        = null
                          + mbps_wr_max    = null
                          + mount          = null
                          + mounted        = false
                          + partition_name = "vdb"
                          + slot           = null
                          + type           = "virtio"
                        },
                    ]
                  + fqdn              = "ali-test.atypon.com"
                  + hostname          = "ali-test"
                  + kind              = null
                  + last_modification = null
                  + modules           = null
                  + name              = "ali-test"
                  + network           = [
                      + {
                          + bridge = "vmbr0"
                          + gw     = "10.5.5.3"
                          + ip     = "10.5.1.22"
                          + model  = "virtio"
                          + nm     = 16
                          + tag    = null
                        },
                    ]
                  + packages          = null
                  + pool              = "Infrastructure"
                  + specs             = {
                      + balloon       = null
                      + boot_order    = "order=virtio0"
                      + config_source = "local"
                      + cores         = 32
                      + hotplug       = "network,disk,usb"
                      + memory        = 131072
                      + sockets       = 2
                      + vcpus         = 48
                    }
                  + swap_maxsize      = 8589934592
                  + swap_size         = null
                  + sysadmin_ssh_keys = [
                      + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2sQQ9zHX4tL7OyyZoJ17ASJ8JUjMLnW1Ts+8Mxqd+tanw1GdnqaBiqsyMcu7QFDuCJsglIZ6VAQ7XtPt4hRKmzZJderA97OqKvg0Ss+RvuscTBfB5XlTpofu5G7lHTCj//dzt1pD04oLjLo5DsLaWOTc2evTnrcoQ6HTm/x/dvWuWpbhE8hH6tMYynJelxJ2SKGATR+PPrpIyAGi/W0N3HAeQHirKGo4+WhZVnCXTLgBV/9+L6T9vLRfgu4okYNSObaIDVMQOZDf354V5EZ1Y/n25hUyewMTOQIusE4dwMBBjUrgBcaUIj04xlh2T/95h37cDTgidw0bTVw6CGzy9 mokhatib@mokhatib-laptop",
                      + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDX/HrxZHySKhVUPJTtdMxMGsefZljYH6enWSkMi0rq1zyiR2LU3EkbAADevRE8iR8NHPZggiWXhrPBq5ofZZ2Agi/bnGNvs44euLGHs2vapXJWQZy/fj+QExFxMPyfI0u/ljrFrnHe+2PXjyWKENiyViYwOFa75DJmhth/r6PVAW0lw47q+hxjpEwqHrdiGffdNzsR6tNc3vGs1WxoHEfYd1Et02Api/FPLy6XuovkNAioEpiDNNC+qjkgcTUKQyHeKYkKrmfcAijLd7w85AqgKhWwj1TOFm0+A40N5m0wdQL8ivQMQBexw+AkhCzEB7gOmmqN55bi/vP+kWuXvBAX adbabi@adbabi-laptop",
                    ]
                  + target_node       = "pveamman1"
                }
            )
        }
    }

  # module.vm["ali-test"].null_resource.validate_memory will be created
  + resource "null_resource" "validate_memory" {
      + id       = (known after apply)
      + triggers = {
          + "s" = "131072"
        }
    }

  # module.vm["ali-test"].proxmox_vm_qemu.vms will be created
  + resource "proxmox_vm_qemu" "vms" {
      + additional_wait           = 0
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=virtio0"
      + bootdisk                  = (known after apply)
      + cicustom                  = "network=local:snippets/ali-test_cloud_init_network.yml,user=local:snippets/ali-test_cloud_init_user.yml"
      + ciuser                    = "root"
      + clone                     = "debian-11.5.0-amd64-1.0"
      + clone_wait                = 0
      + cores                     = 32
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "a VM created via TF"
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 131072
      + name                      = "ali-test"
      + nameserver                = (known after apply)
      + numa                      = true
      + onboot                    = true
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + pool                      = "Infrastructure"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 2
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCrBGriOKGLu83LzPmWnFQyYP0ePLMYK1o4/TmNR/iWW+ClBvQ8vwjnT6n7CZtl0prr8/3Y1SR5o4IqbPwu1LZL6EPiAp9xd6eM6bVNfaREY3UV9hIdL0/qaGqIMKnsz78VKDqKwFwg/0/1clwJ+aOXwKfPWB4XfubYa68+bzqcBN+MG48kTEMsrD95fI+GU8zad08QhAWPVxQImtHCjFzJv8ryb/tZPQeYDz5UZFaaNUaJyeu6hqxuqMsd9N1/BSkkmzSTk/ZjMVj3VvQKgOtCaoWE2X/lbM04/iFdWitrhz3OT1BBcYrgtZQzXt9PT0ynPUZn6Wbu+fE3aTAMWPOZ root@pve201
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC85T2Qw97JxcSi1BMAZsBf3yUZMpsRE7j825P24nIjKbRttCyAH5uO90XZ2f/03RK5+/L3umnLjo0CaMZQ305BK7mO7s+0k4Z1EaVv3PqmQcnnts2ElpROQkKvWUaMj++B9+gqQz03VfKkuDK3XXgtlMxiDnSZ+PKIMa+dX+fGU8ziSoh6o+20a9GIZXUNAIdRZC94L0w5FBb3Q2H4VeuNVoy1QCi5kbSv/M1RjvfLBxQnLRLNmtYfujU6OnZ2uECUZpQV4Bqu2Z92ENXKJKG0IvliA1zjQa2JcThfyK8CsbOhiZIvI2osJ3E0BAELGowIiDogUQ5pF100ca3/F9fV root@prod102
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCxIdS+BiG7oRsfAC55V91v6rxjcKLZoG9U8D+grrM48oaXaY7iwLA27o3U3fy81z3cJirAH0d3CDMf6sAZmYsTZK9qYc4XcIy+iLN81XcSdUbcO0oMuiXqBHDWPZBeiyrh3+c74g0hXHIfR1HUqETv3AViN/THJ1qKByCuNt9H70CEVrMT1IvAuYDKYC4ZWeTmVqpgsHF+V3GxFMJBi5WJzeSUEMwr7w/YzyeLN9DB533s7oSycfQZawcfF2BTYzkQGpfB3rje8v4232o1ZnNbQCdQwO3TH1C4Q2jio12VizQ+/v3KiFWnCay3Cgiaj/IPc7k86FQyD9inA1lVzioR hradaideh@hradaideh
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDGmXSXK0Ksx4EwvkZG+qIX6I6v4PQYEl35OISpdRa6MfmsT7Y3l0zs2FP/FATwXQvDLNYXxQUIYZkfrWWPbZJVaqjRNqs+97TM3zESUzJXOZV8zPZsS1Jo3Q3CN0A8EVIkWJFgzltM7HWSBzFthnv8nH5Q1aIJOzHv0oc+8Mm/BQKyl2QTpj1vB6zZwFf+JfYqw+ktcXwlaL2LEKOE2OnPZmeUV9shNsrSuSwbLzPJmZ2RNjkyX9R1JRpSU1D3XQdoMo/a5JuplUtOIdFl2HstzIddwSMfVxdExz4OhqFJRInGGPlrtHnVQamoRRzSEVQxhbdrXOVHLlBYVx6ttfnJyXrccWIMGh5r9e9axNTMJ2ej4yJzj8Hb2m7Bj8rgfMzRWd7l4nDn20FUvycymXhtC7b8ko/mGzPZkKNUWhW8Gs1fPG0mde8ykNduOOs2PrCDDJHsl0qwmoX3cbZ1/pHDrWAS+urfy3YC99i/zHoOsccIffmr6FgS4lLm0rTVBP6Xw530rB9HxwTRrogkAOIVrcrni2lm2yQzQt75wu4VtjLBnYnpPgG2Jc1k6qZH6BGu4QvrujmybEr/neHYaPFsk65zb5C8Iji7PsOYXekQ3rptQKC10sg3LvALaM+zbXcBP3jDIyQs6wnjyFyq94k1FbrqhKWo9nDhn8a4Du5mCQ== devops-services@atypon.com
        EOT
      + tablet                    = true
      + target_node               = "pveamman1"
      + unused_disk               = (known after apply)
      + vcpus                     = 48
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = 0
          + cache              = "unsafe"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "75G"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "zfs"
          + storage_type       = (known after apply)
          + type               = "virtio"
          + volume             = (known after apply)
        }
      + disk {
          + backup             = 0
          + cache              = "unsafe"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "40G"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "zfs"
          + storage_type       = (known after apply)
          + type               = "virtio"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + vga {
          + memory = 0
          + type   = "std"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
╷
│ Warning: Experimental feature "module_variable_optional_attrs" is active
│ 
│   on .terraform/modules/vm/main.tf line 9, in terraform:
│    9:   experiments      = [module_variable_optional_attrs]
│ 
│ Experimental features are subject to breaking changes in future minor or
│ patch releases, based on feedback.
│ 
│ If you have feedback on the design of this feature, please open a GitHub
│ issue to discuss it.
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p project1-test`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=khatib-moh%252Ftest%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p project1-test`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`